public_html/Web/JavaScript/insert-qq-map.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>网页内嵌入腾讯地图</title>
<!-- 2015-03-05 Thu 23:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />


</head>
<body>
<div id="content">
<h1 class="title">网页内嵌入腾讯地图</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">确定坐标</a></li>
<li><a href="#sec-2">html页面直接加入腾讯地图的js</a></li>
<li><a href="#sec-3">页面内增加地图容器,并标记ID</a></li>
<li><a href="#sec-4">创建地图，并制定地图中心位置</a></li>
<li><a href="#sec-5">增加地点标注</a></li>
<li><a href="#sec-6">增加Label</a></li>
<li><a href="#sec-7">总的</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">确定坐标</h2>
<div class="outline-text-2" id="text-1">
<p>
用<a href="http://open.map.qq.com/doc_v2/tooles/picker.html">坐标拾取器</a>, 把要定位地方的坐标给找出来.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">html页面直接加入腾讯地图的js</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-js">&lt;script type=<span style="color: #ffa07a;">"text/javascript"</span> charset=<span style="color: #ffa07a;">"utf-8"</span> src=<span style="color: #ffa07a;">"http://map.qq.com/api/js?v=2.exp"</span>&gt;&lt;/script&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">页面内增加地图容器,并标记ID</h2>
<div class="outline-text-2" id="text-3">
<p>
可以设置地图相应的width和height.
</p>
<div class="org-src-container">

<pre class="src src-js">&lt;div style=<span style="color: #ffa07a;">"width:100%;height:500px"</span> id=<span style="color: #ffa07a;">"map"</span>&gt;&lt;/div&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">创建地图，并制定地图中心位置<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-4">
<p>
并且在最后调用 <code>init()</code> , 页面加载时候初始化.
</p>
<div class="org-src-container">

<pre class="src src-js">&lt;script type=<span style="color: #ffa07a;">"text/javascript"</span>&gt;
<span style="color: #00ffff;">function</span> <span style="color: #87cefa;">init</span>() {
         <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#20197;&#32428;&#24230;&#21644;&#32463;&#24230;&#34920;&#31034;&#30340;&#22320;&#29702;&#22352;&#26631;&#28857;&#12290;</span>
    <span style="color: #00ffff;">var</span> <span style="color: #eedd82;">center</span>= <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">qq.maps.LatLng</span>(34.245747,108.885558);  
    <span style="color: #00ffff;">var</span> <span style="color: #eedd82;">map</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">qq.maps.Map</span>(                            
        document.getElementById(<span style="color: #ffa07a;">"map"</span>),        <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#22312;id="map"&#30340; HTML &#23481;&#22120;&#20013;&#21019;&#24314;&#26032;&#30340;&#22320;&#22270;</span>
        {
            center:center,                    <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#21021;&#22987;&#30340;&#22320;&#22270;&#20013;&#24515; </span>
            zoom: 14                        <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#22320;&#22270;&#31561;&#32423;</span>
        }
        );

}
init();
&lt;/script&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">增加地点标注</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">marker</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">qq.maps.Marker</span>({        <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#21019;&#24314;&#19968;&#20010;&#26631;&#27880;</span>
       position: center,                    <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#26631;&#27880;&#25152;&#22312;&#20301;&#32622;&#30340;&#22320;&#29702;&#22352;&#26631;&#28857;&#65292;&#24517;&#22635;</span>
       map: map                            <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">&#24453;&#26174;&#31034;&#26631;&#35760;&#30340;&#22320;&#22270;</span>
   });
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">增加Label</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">label</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">qq.maps.Label</span>({
    map: map,
    content <span style="color: #ffa07a;">'&#23431;&#23449;&#20013;&#24515;'</span>,
    offset: <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">qq.maps.Size</span>(-120, 0),
    position: center
});
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">总的</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #87cefa;">script</span> <span style="color: #eedd82;">type</span>=<span style="color: #ffa07a;">"text/javascript"</span> <span style="color: #eedd82;">charset</span>=<span style="color: #ffa07a;">"utf-8"</span> <span style="color: #eedd82;">src</span>=<span style="color: #ffa07a;">"http://map.qq.com/api/js?v=2.exp"</span>&gt;&lt;/<span style="color: #87cefa;">script</span>&gt;
&lt;<span style="color: #87cefa;">div</span> <span style="color: #eedd82;">style</span>=<span style="color: #ffa07a;">"width:100%;height:500px"</span> <span style="color: #eedd82;">id</span>=<span style="color: #ffa07a;">"map"</span>&gt;&lt;/<span style="color: #87cefa;">div</span>&gt;
&lt;<span style="color: #87cefa;">script</span> <span style="color: #eedd82;">type</span>=<span style="color: #ffa07a;">"text/javascript"</span>&gt;
function init() {
         //&#20197;&#32428;&#24230;&#21644;&#32463;&#24230;&#34920;&#31034;&#30340;&#22320;&#29702;&#22352;&#26631;&#28857;&#12290;
var center= new qq.maps.LatLng(34.245747,108.885558);  
var map = new qq.maps.Map(                            
document.getElementById(<span style="color: #ffa07a;">"map"</span>),        //&#22312;id=<span style="color: #ffa07a;">"map"</span>&#30340; HTML &#23481;&#22120;&#20013;&#21019;&#24314;&#26032;&#30340;&#22320;&#22270;
{
center:center,                    //&#21021;&#22987;&#30340;&#22320;&#22270;&#20013;&#24515; 
zoom: 14                        //&#22320;&#22270;&#31561;&#32423;
}
);
var marker = new qq.maps.Marker({        //&#21019;&#24314;&#19968;&#20010;&#26631;&#27880;
      position: center,                    //&#26631;&#27880;&#25152;&#22312;&#20301;&#32622;&#30340;&#22320;&#29702;&#22352;&#26631;&#28857;&#65292;&#24517;&#22635;
      map: map                            //&#24453;&#26174;&#31034;&#26631;&#35760;&#30340;&#22320;&#22270;
});
var label = new qq.maps.Label({
map: map,
content: '&#23431;&#23449;&#20013;&#24515;',
offset: new qq.maps.Size(-120, 0),
   position: center
});
}
init();
&lt;/<span style="color: #87cefa;">script</span>&gt;
</pre>
</div>
<p>
效果如下:
</p>

  <script type="text/javascript" charset="utf-8" src="http://map.qq.com/api/js?v=2.exp"></script>
  <div style="width:100%;height:400px" id="map"></div>
  <script type="text/javascript">
  function init() {
           //以纬度和经度表示的地理坐标点。
  var center= new qq.maps.LatLng(34.245747,108.885558);  
  var map = new qq.maps.Map(                            
  document.getElementById("map"),        //在id="map"的 HTML 容器中创建新的地图
  {
  center:center,                    //初始的地图中心 
  zoom: 14                        //地图等级
  }
  );
  var marker = new qq.maps.Marker({        //创建一个标注
        position: center,                    //标注所在位置的地理坐标点，必填
        map: map                            //待显示标记的地图
  });
  var label = new qq.maps.Label({
  map: map,
  content: '宇宙中心',
  offset: new qq.maps.Size(-120, 0),
     position: center
  });
  }
init();
  </script>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://open.map.qq.com/doc_v2/guide-map.html">http://open.map.qq.com/doc_v2/guide-map.html</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-03-05 Thu 23:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
